<details><summary>Show Plan</summary>

```

terraform
data.assert_test.workspace: Reading...
data.assert_test.workspace: Read complete after 0s
module.monitoring.grafana_data_source.cloudwatch: Refreshing state... [id=55]
data.aws_ecr_repository.repository: Reading...
module.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...
aws_kms_key.analytics_bucket: Refreshing state... [id=6bfc377d-7703-430c-ab6f-ccdc2c595e8d]
aws_s3_bucket.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=1077804475]
module.ecs.aws_iam_policy.analytics-data-lake_bucket_access: Refreshing state... [id=arn:aws:iam::898587786287:policy/staging_rpc-proxy_analytics-data-lake_bucket_access]
module.logging.aws_s3_bucket.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/2ae2b34a-15d0-4db2-9a58-9d73cc757c11]
module.ecs.data.aws_ecr_image.service_image: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-08e1d4105700a530f]
module.ecs.aws_cloudwatch_log_group.cluster_logs: Refreshing state... [id=staging_rpc-proxy_logs]
aws_prometheus_workspace.prometheus: Refreshing state... [id=ws-bbafeb15-8e6b-4c49-a272-7b9f5b454692]
module.ecs.aws_iam_policy.geoip_bucket_access: Refreshing state... [id=arn:aws:iam::898587786287:policy/staging_rpc-proxy_geoip_bucket_access]
module.backup_dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/5e35ff7b-5e4c-4424-abdc-20b9442de182]
module.ecs.data.aws_ecr_image.service_image: Read complete after 1s [id=sha256:7c79a60e07d6765f5d0cd71520bc0443df4fd6ba01ec912ba8eff784ef0a10d9]
module.backup_dns.data.aws_route53_zone.hosted_zone: Reading...
module.postgres.module.db_cluster.data.aws_partition.current: Reading...
module.postgres.module.db_cluster.data.aws_partition.current: Read complete after 0s [id=aws]
module.dns.data.aws_route53_zone.hosted_zone: Reading...
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role]
module.ecs.aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:cluster/staging_rpc-proxy_cluster]
module.postgres.module.db_cluster.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Reading...
module.postgres.module.db_cluster.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Read complete after 0s [id=76086537]
aws_kms_alias.analytics_bucket: Refreshing state... [id=alias/analytics/rpc-proxy/staging]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20230531132946444300000003]
module.ecs.aws_iam_role_policy_attachment.attachment: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20230606101901548400000001]
module.ecs.aws_iam_role_policy_attachment.geoip-bucket-policy-attach: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20230531132946907600000006]
module.ecs.aws_iam_role_policy_attachment.analytics-data-lake_policy-attach: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20230706143005711600000001]
module.ecs.aws_iam_role_policy_attachment.cloudwatch_write_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20230531132946627800000004]
module.ecs.aws_iam_role_policy_attachment.prometheus_write_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20230531132946808400000005]
module.monitoring.grafana_data_source.prometheus: Refreshing state... [id=56]
module.backup_dns.data.aws_route53_zone.hosted_zone: Read complete after 0s [id=Z025697917GKV1T3MTR7I]
module.backup_dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z025697917GKV1T3MTR7I__4d22d935f4bfd18f85fd77a386484a45.staging.rpc.walletconnect.org._CNAME]
module.dns.data.aws_route53_zone.hosted_zone: Read complete after 0s [id=Z09669243E0Q6ZCWCIW2U]
module.dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z09669243E0Q6ZCWCIW2U__4298f596ebd4d4df199cb24cba8db7f8.staging.rpc.walletconnect.com._CNAME]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0e10c56966031ba21]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0356075dd4cc2b821]
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-rpc-proxy-286/995cb43faf7b24a9]
module.ecs.aws_security_group.tls_ingress: Refreshing state... [id=sg-059ed79801194c355]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0ee29703654ee1fa0]
module.ecs.aws_security_group.vpc_app_ingress: Refreshing state... [id=sg-01ed3fb2f60f29a6c]
module.redis.aws_security_group.service_security_group: Refreshing state... [id=sg-007c09cd174309d64]
data.aws_ecr_repository.repository: Read complete after 2s [id=rpc-proxy]
module.ecs.aws_security_group.sigv4_proxy_vpc_ingress: Refreshing state... [id=sg-0d4d6627dbf062499]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0f0392afb0a50fa75]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0d8cec98cc084a6c0]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0be1aaa30e209cd55]
module.ecs.aws_security_group.vpc-endpoint-group: Refreshing state... [id=sg-08fdce012dad52135]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-015ac176b508ff81c]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0ca95c4d38dd99148]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-022380294baf1fadb]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-000aa857ad656638d]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f205be71f35494d5]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-07110e373066d1158]
aws_s3_bucket_ownership_controls.analytics-data-lake_controls: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
aws_s3_bucket_versioning.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
aws_s3_bucket_server_side_encryption_configuration.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
aws_s3_bucket_public_access_block.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
module.logging.aws_s3_bucket_versioning.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.logging.aws_s3_bucket_server_side_encryption_configuration.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.logging.aws_s3_bucket_ownership_controls.logging_bucket-controls: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.logging.data.aws_iam_policy_document.allow_logging_service: Reading...
module.logging.data.aws_iam_policy_document.allow_logging_service: Read complete after 0s [id=3646663536]
module.logging.aws_s3_bucket_lifecycle_configuration.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.logging.aws_s3_bucket_public_access_block.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0d8cec98cc084a6c01080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0450e7dd96d947c14]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0deb8a517fe199133]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-063c21398e3426434]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0cb8d8c8d5ae2b433]
aws_s3_bucket_logging.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
module.logging.aws_s3_bucket_policy.allow_logging_service: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-005a0be9db8189ebd]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-03d56859521c56b1f]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0090d9f40c0f6230d]
aws_s3_bucket_acl.analytics-data-lake_acl: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake,private]
module.logging.aws_s3_bucket_acl.logging_bucket-acl: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs,log-delivery-write]
module.ecs.aws_alb.network_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/net/staging-rpc-proxy-lb-23d/dcb91fc403cb1805]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04a073e56ee60f58a]
module.ecs.aws_vpc_endpoint.ssm: Refreshing state... [id=vpce-086657e31ef0eab6a]
module.ecs.aws_vpc_endpoint.dkr: Refreshing state... [id=vpce-0f9d880d58c4a6129]
module.ecs.aws_vpc_endpoint.cloudwatch: Refreshing state... [id=vpce-0abe6e646cd2f6967]
module.ecs.aws_vpc_endpoint.ecrapi: Refreshing state... [id=vpce-022df236a84600f02]
module.ecs.aws_vpc_endpoint.prometheus: Refreshing state... [id=vpce-02be456175a5ca17d]
module.redis.aws_elasticache_subnet_group.private_subnets: Refreshing state... [id=rpc-proxy-rpc-staging-private-subnet-group]
module.ecs.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-0deded9d20a06fa95]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0be1aaa30e209cd551080289494]
module.ecs.aws_route53_record.dns_load_balancer: Refreshing state... [id=Z09669243E0Q6ZCWCIW2U_staging.rpc.walletconnect.com_A]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/net/staging-rpc-proxy-lb-23d/dcb91fc403cb1805/68d85a48f0652613]
module.ecs.aws_route53_record.backup_dns_load_balancer: Refreshing state... [id=Z025697917GKV1T3MTR7I_staging.rpc.walletconnect.org_A]
module.ecs.aws_lb_listener_certificate.backup_cert: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/net/staging-rpc-proxy-lb-23d/dcb91fc403cb1805/68d85a48f0652613_arn:aws:acm:eu-central-1:898587786287:certificate/5e35ff7b-5e4c-4424-abdc-20b9442de182]
module.redis.aws_elasticache_cluster.cache: Refreshing state... [id=rpc-proxy-rpc-staging]
module.monitoring.data.jsonnet_file.dashboard: Reading...
module.ecs.aws_ecs_task_definition.app_task: Refreshing state... [id=staging_rpc-proxy]
module.monitoring.data.jsonnet_file.dashboard: Read complete after 0s [id=48cf831f54e6b549cac48425a59b308a4dde1c31058a84240cfa11f1b06a903e]
module.monitoring.grafana_dashboard.dashboard: Refreshing state... [id=0:staging-rpc-proxy]
module.ecs.aws_ecs_service.app_service: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:service/staging_rpc-proxy_cluster/staging_rpc-proxy-service]
module.ecs.aws_appautoscaling_target.ecs_target: Refreshing state... [id=service/staging_rpc-proxy_cluster/staging_rpc-proxy-service]
module.ecs.aws_appautoscaling_policy.cpu_scaling: Refreshing state... [id=staging_rpc-proxy-application-scaling-policy-cpu]
module.ecs.aws_appautoscaling_policy.memory_scaling: Refreshing state... [id=staging_rpc-proxy-application-scaling-policy-memory]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_rpc-proxy_cluster/staging_rpc-proxy-service"
        name                               = "staging_rpc-proxy-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy:280" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task must be replaced
-/+ resource "aws_ecs_task_definition" "app_task" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy:265" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging_rpc-proxy" -> (known after apply)
      ~ revision                 = 265 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.postgres.random_password.db_master_password[0] will be created
  + resource "random_password" "db_master_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.postgres.module.db_cluster.aws_iam_role.rds_enhanced_monitoring[0] will be created
  + resource "aws_iam_role" "rds_enhanced_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = {
          + "Application"      = "rpc-proxy"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "rpc-proxy"
          + "ProvisionedBy"    = "Terraform"
        }
      + unique_id             = (known after apply)
    }

  # module.postgres.module.db_cluster.aws_iam_role_policy_attachment.rds_enhanced_monitoring[0] will be created
  + resource "aws_iam_role_policy_attachment" "rds_enhanced_monitoring" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
      + role       = (known after apply)
    }

  # module.postgres.module.db_cluster.aws_rds_cluster.this[0] will be created
  + resource "aws_rds_cluster" "this" {
      + allocated_storage               = (known after apply)
      + allow_major_version_upgrade     = true
      + apply_immediately               = true
      + arn                             = (known after apply)
      + availability_zones              = (known after apply)
      + backtrack_window                = 0
      + backup_retention_period         = 7
      + cluster_identifier              = "rpc-proxy-postgres-cluster"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + copy_tags_to_snapshot           = false
      + database_name                   = "postgres"
      + db_cluster_parameter_group_name = (known after apply)
      + db_subnet_group_name            = "rpc-proxy-postgres-cluster"
      + deletion_protection             = true
      + enable_global_write_forwarding  = false
      + enable_http_endpoint            = false
      + endpoint                        = (known after apply)
      + engine                          = "aurora-postgresql"
      + engine_mode                     = "provisioned"
      + engine_version                  = "16.1"
      + engine_version_actual           = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + iam_roles                       = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = (known after apply)
      + master_password                 = (sensitive value)
      + master_user_secret              = (known after apply)
      + master_user_secret_kms_key_id   = (known after apply)
      + master_username                 = "pgadmin"
      + network_type                    = (known after apply)
      + port                            = 5432
      + preferred_backup_window         = "02:00-03:00"
      + preferred_maintenance_window    = "sun:05:00-sun:06:00"
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = true
      + storage_encrypted               = true
      + storage_type                    = (known after apply)
      + tags_all                        = {
          + "Application"      = "rpc-proxy"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "rpc-proxy"
          + "ProvisionedBy"    = "Terraform"
        }
      + vpc_security_group_ids          = (known after apply)

      + serverlessv2_scaling_configuration {
          + max_capacity = 10
          + min_capacity = 2
        }

      + timeouts {}
    }

  # module.postgres.module.db_cluster.aws_rds_cluster_instance.this["1"] will be created
  + resource "aws_rds_cluster_instance" "this" {
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = "rpc-proxy-postgres-cluster"
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-postgresql"
      + engine_version                        = "16.1"
      + engine_version_actual                 = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "rpc-proxy-postgres-cluster-1"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.serverless"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 30
      + monitoring_role_arn                   = (known after apply)
      + network_type                          = (known after apply)
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = "sun:05:00-sun:06:00"
      + promotion_tier                        = 0
      + publicly_accessible                   = false
      + storage_encrypted                     = (known after apply)
      + tags_all                              = {
          + "Application"      = "rpc-proxy"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "rpc-proxy"
          + "ProvisionedBy"    = "Terraform"
        }
      + writer                                = (known after apply)

      + timeouts {}
    }

  # module.postgres.module.db_cluster.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Control traffic to/from RDS Aurora rpc-proxy-postgres-cluster"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "rpc-proxy-postgres-cluster-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "rpc-proxy-postgres-cluster"
        }
      + tags_all               = {
          + "Application"      = "rpc-proxy"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "rpc-proxy-postgres-cluster"
          + "ProvisionedBy"    = "Terraform"
        }
      + vpc_id                 = "vpc-08e1d4105700a530f"
    }

  # module.postgres.module.db_cluster.aws_security_group_rule.this["vpc_ingress"] will be created
  + resource "aws_security_group_rule" "this" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

Plan: 8 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/plan.tfplan"

```

</details>

*Action: `pull_request`*